W6D4/art_share/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        artwork_shares = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 25], ["viewer_id", 70], ["created_at", "2020-01-24 00:33:20.063947"], ["updated_at", "2020-01-24 00:33:20.063947"]]
SELECT "artwork_shares".* FROM "artwork_shares"
---
    def create

        artwork_share = ArtworkShare.new(artwork_share_params)
        artwork_share.save!
        render json: ArtworkShare.all