W6D4/art_share/app/controllers/artworks_controller.rb

    def create

        artwork = Artwork.new(artwork_params)
        artwork.save!
        render json: Artwork.all
---
INSERT INTO "artworks" ("title", "image_url", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "p"], ["image_url", "ppng"], ["created_at", "2020-01-24 00:22:47.201592"], ["updated_at", "2020-01-24 00:22:47.201592"], ["artist_id", 58]]
SELECT "artworks".* FROM "artworks"