W6D4/art_share/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        user.save!
        render json: User.all
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "future"], ["created_at", "2020-01-23 22:36:21.438704"], ["updated_at", "2020-01-23 22:36:21.438704"]]
SELECT "users".* FROM "users"

    def destroy
        user = User.find(params[:id])
        user.destroy
        render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 16]]
SELECT "users".* FROM "users"